const portfolios = [
    {
      name: "Prach ChemEN Kmutt",
      university: "คณะวิศวกรรมศาสตร์ ภาควิชาวิศวกรรมเคมี มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี",
      description: "ยื่นไป 4 ที่ได้สัม2ที่คือลาดกระบังกับบางมดคับลาดกระบังได้สัมแต่ไม่ผ่านโครงการสอวน.คับ ❌️ส่วนบางมดก็ที่ว่าไปข้างบนเลยย 🫡<br>น้องๆสามารถมาปรึกษาพี่ได้ทุกเรื่องเลยครับไม่ว่าจะเรื่องสอบสัมภาษณ์เป็นยังไงคำถามยากมั้ยแล้วก็พี่เตรียมตัวสัมยังไงในแบบของพี่คับ 🙂สามารถทำมาดูพอร์ตได้นะค้าบบ",
      image: "../images/Prach.jpg",
      instagram: "https://www.instagram.com/ppppprachhhhh/?utm_source=ig_web_button_share_sheet"
    },
    {
      name: "Oak ICT MU",
      university: "ICT Mahidol",
      description: "ติดรอบพอร์ตไม่มีสอวน.<br><br>รอบ early-admission (ก่อนรอบพอร์ต)Early-admission มันแล้วแต่มหาลัยเเล้วเเต่คณะนะว่ามีไหมไปลองหาข้อมูลดูก่อน ถ้าติดรอบนี้ก็มีมหาลัยก่อนเพื่อนเลย<br>ทักมาขอพอร์ตหรือจะปรึกษาคณะเกี่ยวกับ it หรือ วิศวะได้นะ",
      image: "../images/Oak.jpg",
      instagram: "https://www.instagram.com/oxk_ptc/?utm_source=ig_web_button_share_sheet"
    },
    {
      name: "Pun iCPE Kmutt",
      university: "International Computer Engineering KmuTt",
      description: "<br>Early round admission<br><br>International Computer Engineering KmuTt",
      image: "../images/Punz.jpg",
      instagram: "https://www.instagram.com/pun.ngm?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw=="
    },
    {
      name: "Krit ICT MU",
      university: "Faculty of Information and Communication Technology",
      description: "รอบ Early Portfolio เดือนกันยายนติดสัมภาษณ์ ✅ ผ่านสัมภาษณ์✅<br><br>คณะ จะมี 4 core 8 track<br>1. ComSci<br>2. Database and Intelligence System<br>3. Computer Network<br>4. Software Engineering<br>5. Electronic Business System<br>6. Multimedia System<br>7. Management Information System<br>8. Health Information Technology<br>ทำให้มีตัวเลือกเรียนหลายสาย จะได้มีตัวเลือกทำงานมากขึ้นตั้งแต่ งานวิศวะ-งานโรงพยาบาลคณะนี้มีทั้งหลักสูตรไทยและอินเตอร์ แต่หลักสูตรที่เรียนต่างกันนะ",
      image: "../images/Krit.jpg",
      instagram: "https://www.instagram.com/kkrixt._/"
    },
    {
      name: "Focus",
      university: "คณะพาณิชยศาสต์และการบัญชี หลักสูตรบัญชีบัณฑิต จุฬาลงกรณ์มหาวิทยาลัย💗(สัม)",
      description: "สวัสดีคร่าา พี่โฟกัสนะคะสามารถทักมาขอดูพอร์ตได้เลยนะสารภาพเลยว่าทำพอร์ตก่อนส่ง 5ชั่วโมง (ซึ่งไม่ควรเอาเป็นแบบอย่าง)🚨พี่ยื่นพอร์ตเข้า โครงการรับสมัครคัดเลือกนักเรียนที่มีความสามารถทางวิชาการ คณะพาณิชยศาสต์และการบัญชี หลักสูตรบัญชีบัณฑิต จุฬาลงกรณ์มหาวิทยาลัย💗ใช้ สอวน.ภูมิศาสตร์ค่าย2 🌏✅มีสิทธิ์สัมภาษณ์คนสมัคร1000++ คัดสัม26  ผ่านสัม4คนสามารถใช้สอวน.ค่าย2ไม่จำกัดวิชา หรือ SAT หรือ CU-AAT ยื่นพี่ยื่นแค่ที่เดียวเลยคับ",
      image: "../images/Focus.jpg",
      instagram: "https://www.instagram.com/focus_pp.p?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw=="
      },
    {
      name: "Pang Logis kmutnb",
      university: "คณะวิศวกรรมศาสตร์ สาขาวิศวกรรมโลจิสติกส์ ที่มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ",
      description: "สวัสดีค่า พี่ชื่อแป้งนะ⭐️ตอนนี้ติดคณะวิศวกรรมศาสตร์ สาขาวิศวกรรมโลจิสติกส์ ที่มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือรอบพอร์ตจ้า~จริงๆพี่ยื่นโควต้ารร.ของวิศวะโลจิส ม.ศิลด้วยนะ แต่พี่เลือก มจพ.หลักๆพี่ยื่นที่เดียวเลย เพราะพี่เล็งที่นี้อันดับ1<br>ถ้าน้องๆ คนไหนสนใจคณะนี้หรืออยากรู้ว่าเตรียมตัวยังไง หรืออยากดูพอร์ต ทักมาคุยกันได้เลยน้า ไม่ต้องเกรงใจเลยเป็นกำลังใจให้ทุกคนที่กำลังเตรียมตัวเข้ามหาลัยนะ สู้ไปด้วยกันจ้า!",
      image: "../images/Pang.jpg",
      instagram: "https://www.instagram.com/pangjii_26?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw=="
    }
  ];
  
  const container = document.getElementById("cardContainer");
  
  portfolios.forEach(port => {
    const card = document.createElement("div");
    card.className = "horizontal-card";
    card.innerHTML = `
      <img src="${port.image}" alt="${port.name}">
      <div class="card-details">
        <h3>${port.name}</h3>
        <p><strong>คณะที่ยื่น:</strong> ${port.university}</p>
        <p>${port.description}</p>
        <p><a href="${port.instagram}" target="_blank" style="color:#1da1f2;">Instagram</a></p>
      </div>
    `;
    container.appendChild(card);
  });
  